Revit 2027 API
ParameterAccess.GetParameter(LinkElementId, Document, ElementId) Method
 Retrieves the parameter value for the parameter belonging to the parameter document on the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EvaluatedParameter GetParameter(
	LinkElementId elementId,
	Document parameterDoc,
	ElementId parameterId
)
Public Function GetParameter (
	elementId As LinkElementId,
	parameterDoc As Document,
	parameterId As ElementId
) As EvaluatedParameter
public:
EvaluatedParameter^ GetParameter(
	LinkElementId^ elementId,
	Document^ parameterDoc,
	ElementId^ parameterId
)
member GetParameter :
        elementId : LinkElementId *
        parameterDoc : Document *
        parameterId : ElementId -> EvaluatedParameter
Parameters
elementId LinkElementId
LinkElementId of the element whose parameter value is requested.
parameterDoc Document
 The document which contains the parameter.
parameterId ElementId
 The id of the parameter to obtain.
Return Value
EvaluatedParameter
 The evaluated parameter value or a default object if no value exists.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterAccess Class
GetParameter Overload
Autodesk.Revit.DB Namespace